2019年个人年终总结

	回首2019，有刚刚出来的些许迷茫，也有熟悉之后的自在，有能力不足的担忧，也有自我提升后的喜悦；时光就像掌心里的水，不论摊开还是握紧，终究还是会从指缝中一滴一滴流淌干净，只是，那水的温度，却是可让人无法忘记。
	100天，说长不长，说短也不短，我很庆幸我来到了一个很好的团队，公司的良好成长，老大的开拓眼界，团队的朝气活力，都深深影响着我。
	回顾100天的工作，和中台产生了千丝万缕的联系，从刚来时老后台的优化以及修改，到处理新财务的路由缓存，再到中后台基础模块开发，再到中后台业务模块开发。和中后台也产生了独有的感情，我很庆幸自己能够一门心思去做一件事，老大也给了我这个机会让我放手去干去做。
	个人的主要工作：
1. 坚定一个form，一个table，一个modal的理念，把中后台基础模块拆分为几个高复用的组件，保证了逻辑的一致性，某种程度上会减少通用bug的产生，精简业务页面的代码量，新人熟悉后开发效率会有较好的提升；
2. 中后台业务代码的开发，风控模块，会员模块，运营模块，运维模块中部分页面开发；
3. 根据业务的需求，去拓展组件功能，包括表头筛选支持，表格汇总，表单功能模块，弹出拖拽等；
4. 团队的工作中协调沟通以及解决bug；
	充实和繁忙伴随着这100个日日夜夜，每天对接需求和处理问题，繁忙的工作却很难去量化，不过当看到中后台一点一滴的搭建起来，能保证业务部门的正常使用，所做的工作能够得到业务部门的认可，觉得付出是挺值的；当然，在工作中我也有很多的不足，在此也进行总结，希望在以后的工作中能够得到改善的重视；
	个人的工作不足：
  1.  粗心大意，在项目开发中不够仔细，场景思考的不够全面，产生了很多不应该出现的bug；
  2. 管理经验不足，一方面为个人性格原因，情绪控制，语言组织方面还有较大的提升空间；还有部分原因是容易忘事，需要时刻提醒自己；
  3. 技术能力还有较大的提升空间，技术栈不全面，原理理解不通透，逻辑不全面，停留在初级应用的层次，很希望自己能够写出一些好用的工具库；
  
	公司有许多别致的项目，会用到很多新的技术栈，若能参与其中，肯定会获益匪浅。我十分愿意去接受挑战，在技术道路上能够得到全面的发展。古人云，三十而立，立身，立业，立家。凡事都得沉下心，好好积累一下自己。
